# Bases de Datos I
## Laboratorio 11: Consolidaci√≥n SQL.

¬°¬°¬ø¬øEn este punto ya somos todos unos expertos en Bases de Datos verdad??!!

;)

¬°¬øQu√© tal si desarrollamos un par de ejercicios m√°s para fijar todo ese s√∫per conocimiento que hemos adquirido de MySQL!? Adelanteee...

### Configuraci√≥n ‚öôÔ∏è

In [2]:
import sqlalchemy
sqlalchemy.create_engine("mysql://root:root@localhost:3306")

%load_ext sql
%sql mysql://root:root@localhost:3306

### Ejercicios üèãÔ∏è‚Äç‚ôÇÔ∏è

Cinesoft es una empresa cubana de Inform√°tica y Medios Audiovisuales que ofrece soluciones innovadoras orientadas a elevar la calidad del sistema educativo y la gesti√≥n del conocimiento. Para llevar el control de los proyectos que desarrolla, los empleados que all√≠ laboran, etc, la compa√±√≠a cuenta con una base de datos de la cual se extrae el fragmento que se muestra a continuaci√≥n.

**Empleado** (<u>IdE</u> int PRIMARY KEY, Nombre varchar(20), Apellido varchar(20), IdD int, Salario double, Experiencia varchar(20), Edad int)

IdD FK Departamento.IdD

**Departamento**(<u>IdD</u> int PRIMARY KEY, NombreDpto varchar(20), ManagerId int)

ManagerId FK Empleado.IdD

**Proyecto**(<u>IdP</u> int PRIMARY KEY, NombreProyecto varchar(30), Descripci√≥n varchar(50), Presupuesto double, Fecha de inicio DATE, Estado varchar(20), IdD int )

IdD FK Departamento.IdD

**Candidato**(<u>IdC</u> int PRIMARY KEY, Nombre varchar(20), Apellido varchar(20), Salario double, Experiencia varchar(20), Edad int, Puntos int)

In [26]:
%%sql 
CREATE DATABASE IF NOT EXISTS Cinesoft;
USE Cinesoft;

 * mysql://root:***@localhost:3306
1 rows affected.
0 rows affected.

[]

In [ ]:
%%sql

CREATE TABLE Empleado( 
    IdE INT UNSIGNED NOT NULL AUTO_INCREMENT PRIMARY KEY,
    Nombre varchar(20),
    Apellido varchar(20),
    Salario double unsigned,
    Experiencia varchar(20),
    IdD int REFERENCES Departamento(IdD)
        ON DELETE SET NULL
        ON UPDATE CASCADE,
    Edad int
);

In [ ]:
%%sql
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Diana', 'Lopez', 11000,'Senior', 1, 30);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Mary', 'Ibarra', 12000,'Senior', 6, 35);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Arlen', 'Echarte', 10000,'Senior', 2, 32);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Jos', 'Alberti', 8000,'Inmediate', 8, 37);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Alina', 'Diaz', 11000,'Senior', 7, 45);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Marcos', 'Martin', 7000,'Inmediate', 3, 44);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Andy', 'Paul', 4000,'Junior', 4, 27);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Victor', 'Lau', 3000,'Junior', 5, 29);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Ruben', 'Peral', 11000,'Senior', 6, 50);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Marcos', 'Perez', 7000,'Inmediate', 3, 44);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Andy', 'Ron', 9000,'Senior', 4, 60);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Victor', 'Klas', 6000,'Intermediate', 5, 27);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Marcos', 'Martinez', 7000,'Inmediate', 3, 44);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('Paulina', 'Rubio', 4000,'Junior', 4, 27);
INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad) VALUES ('David', 'Bisbal', 3000,'Junior', 5, 29);

In [ ]:
%%sql

CREATE TABLE Candidato( 
    IdC INT UNSIGNED NOT NULL AUTO_INCREMENT PRIMARY KEY,
    Nombre varchar(20),
    Apellido varchar(20),
    Experiencia varchar(20),
    Edad int,
    Puntos int
);

In [ ]:
%%sql

INSERT INTO Candidato (Nombre, Apellido, Experiencia, Edad, Puntos) VALUES ('Gabriel', 'Jolas', 'Senior', 28, 99);
INSERT INTO Candidato (Nombre, Apellido, Experiencia, Edad, Puntos) VALUES ('Yosy', 'Contrera', 'Senior', 20, 40);
INSERT INTO Candidato (Nombre, Apellido, Experiencia, Edad, Puntos) VALUES ('Susana', 'Giraldo', 'Junior', 38, 30);
INSERT INTO Candidato (Nombre, Apellido, Experiencia, Edad, Puntos) VALUES ('Ana', 'Valerio', 'Junior', 24, 29);
INSERT INTO Candidato (Nombre, Apellido, Experiencia, Edad, Puntos) VALUES ('Hector', 'Alfred', 'Intermediate', 29, 70);
INSERT INTO Candidato (Nombre, Apellido, Experiencia, Edad, Puntos) VALUES ('Alexander', 'Joas', 'Junior', 30, 85);
INSERT INTO Candidato (Nombre, Apellido, Experiencia, Edad, Puntos) VALUES ('Alfredo', 'Tomas', 'Senior', 40, 95);

In [ ]:
%%sql

CREATE TABLE Departamento( 
    IdD INT UNSIGNED NOT NULL AUTO_INCREMENT PRIMARY KEY,
    NombreDpto varchar(30),
    ManagerId int REFERENCES Empleado(IdE)
        ON DELETE SET NULL
        ON UPDATE CASCADE
);

In [ ]:
%%sql
INSERT INTO Departamento (IdD, NombreDpto, ManagerId) VALUES (1, 'Sistemas', 1);
INSERT INTO Departamento (IdD, NombreDpto, ManagerId) VALUES (2, 'Ventas', 5);
INSERT INTO Departamento (IdD, NombreDpto, ManagerId) VALUES (3, 'Recursos Humanos', 8);
INSERT INTO Departamento (IdD, NombreDpto, ManagerId) VALUES (4, 'IA', 1);
INSERT INTO Departamento (IdD, NombreDpto, ManagerId) VALUES (5, 'Marketing', 2);
INSERT INTO Departamento (IdD, NombreDpto, ManagerId) VALUES (6, 'Log√≠stica y Operaciones', 6);
INSERT INTO Departamento (IdD, NombreDpto, ManagerId) VALUES (7, 'Direcci√≥n General', 3);
INSERT INTO Departamento (IdD, NombreDpto, ManagerId) VALUES (8, 'Control de Gesti√≥n', 9);

In [ ]:
%%sql

CREATE TABLE Proyecto( 
    IdP INT UNSIGNED NOT NULL AUTO_INCREMENT PRIMARY KEY,
    NombreProyecto varchar(30),
    Descripci√≥n varchar(50),
    Presupuesto double unsigned,
    FechaInicio Date,
    Estado varchar(20),
    IdD int REFERENCES Departamento(IdD)
        ON DELETE SET NULL
        ON UPDATE CASCADE
);

In [ ]:
%%sql
INSERT INTO Proyecto (IdP, NombreProyecto, Descripci√≥n, Presupuesto, FechaInicio, Estado, IdD) VALUES (1, "Sistemas Preguntas Respuestas", "Lorem Ipsum", 160000, '2021-04-01', "Completado", 4);
INSERT INTO Proyecto (IdP, NombreProyecto, Descripci√≥n, Presupuesto, FechaInicio, Estado, IdD) VALUES (2, "√Årbol rojo feroz", "Lorem Ipsum", 350000, '2021-03-01', "Completado", 1);
INSERT INTO Proyecto (IdP, NombreProyecto, Descripci√≥n, Presupuesto, FechaInicio, Estado, IdD) VALUES (3, "IA para todos", "Lorem Ipsum", 170000, '2022-05-01', "En curso", 1);
INSERT INTO Proyecto (IdP, NombreProyecto, Descripci√≥n, Presupuesto, FechaInicio, Estado, IdD) VALUES (4, "Odisea azul", "Lorem Ipsum", 140000, '2023-04-01', "Completado", 1);
INSERT INTO Proyecto (IdP, NombreProyecto, Descripci√≥n, Presupuesto, FechaInicio, Estado, IdD) VALUES (5, "A", "Lorem Ipsum", 500000, '2020-02-01', "Completado", 2);
INSERT INTO Proyecto (IdP, NombreProyecto, Descripci√≥n, Presupuesto, FechaInicio, Estado, IdD) VALUES (6, "B", "Lorem Ipsum", 400000, '2019-06-01', "Completado", 2);
INSERT INTO Proyecto (IdP, NombreProyecto, Descripci√≥n, Presupuesto, FechaInicio, Estado, IdD) VALUES (7, "C", "Lorem Ipsum", 160000, '2022-07-01', "En curso", 2);
INSERT INTO Proyecto (IdP, NombreProyecto, Descripci√≥n, Presupuesto, FechaInicio, Estado, IdD) VALUES (8, "Capacitaci√≥n inicial", "Lorem Ipsum", 200000, '2023-02-01', "En curso", 5);
INSERT INTO Proyecto (IdP, NombreProyecto, Descripci√≥n, Presupuesto, FechaInicio, Estado, IdD) VALUES (9, "Terciopelo", "Lorem Ipsum", 360000, '2023-04-01', "Pausado", 5);
INSERT INTO Proyecto (IdP, NombreProyecto, Descripci√≥n, Presupuesto, FechaInicio, Estado, IdD) VALUES (10, "Llama dorada", "Lorem Ipsum", 250000, '2019-03-01', "Completado", 8);
INSERT INTO Proyecto (IdP, NombreProyecto, Descripci√≥n, Presupuesto, FechaInicio, Estado, IdD) VALUES (11, "Cosecha de √°mbar", "Lorem Ipsum", 150000, '2018-02-01', "Fallido", 6);

Una vez ejecutadas las celdas para la creaci√≥n de esta BD considere dar respuesta a los requerimientos que se muestran a continuaci√≥n.

a) Proporcione una lista de todos los empleados pertenecientes a departamentos administrados por Diana Lopez.

In [7]:
%%sql

SELECT 
  Nombre,
  Apellido
FROM Empleado as e1
WHERE IdD IN (
   SELECT d.IdD
   FROM Departamento as d
    Inner Join Empleado as e2
       on d.ManagerId = e2.IdE
   WHERE Nombre = "Diana"
    and Apellido = "Lopez")

 * mysql://root:***@localhost:3306
4 rows affected.

[('Diana', 'Lopez'), ('Andy', 'Paul'), ('Andy', 'Ron'), ('Paulina', 'Rubio')]

b) Recupere el n√∫mero de trabajadores asociados a un mismo departamento que posean igual salario.

In [8]:
%%sql

SELECT
  IdD,
  Salario,
  COUNT(*) AS NoEmpleados
FROM Empleado
GROUP BY
  IdD,
  Salario
HAVING COUNT(*) > 1

#(Aqui resaltar que en tablas donde el id fuera 
# autom'atico esto permitiria encontrar filas repetidas, 
# al seleccionar todos los atts para el group by)

 * mysql://root:***@localhost:3306
3 rows affected.

[(3, 7000.0, 3), (4, 4000.0, 2), (5, 3000.0, 2)]

c) Obtener los salarios totales en los departamentos de Ventas y Recursos Humanos combinados y en los departamentos de IA y Sistemas combinados.

In [9]:
%%sql

SELECT
    Sum(CASE
            WHEN NombreDpto IN ("Ventas", "Recursos Humanos")
            THEN Salario
            ELSE 0
            END
        ) AS GastosPorSalarioVentasRH,
    Sum(CASE
            WHEN NombreDpto IN ("IA", "Sistemas")
            THEN Salario
            ELSE 0
            END
        ) AS GastosPorSalarioIASistemas
FROM Empleado AS e Inner Join Departamento AS d
    ON e.IdD = d.IdD

 * mysql://root:***@localhost:3306
1 rows affected.

[(31000.0, 28000.0)]

d) Cuente cu√°ntos empleados hay en cada rango de salario: bajo, medio y alto. Considere que menos de 3000 es bajo, m√°s de 10000 alto y el resto medio.

In [10]:
%%sql

SELECT
  CASE
    WHEN Salario < 4000 THEN "Bajo"
    WHEN Salario >= 4000 AND Salario <= 10000 THEN "Medio"
    WHEN Salario > 10000 THEN "Alto"
  END AS CategSalario,
  COUNT(*) AS NoEmpleados
FROM Empleado
GROUP BY
    CASE
        WHEN Salario < 4000 THEN "Bajo"
        WHEN Salario >= 4000 AND Salario <= 10000 THEN "Medio"
        WHEN Salario > 10000 THEN "Alto"
END

 * mysql://root:***@localhost:3306
3 rows affected.

[('Alto', 4), ('Medio', 9), ('Bajo', 2)]

e) Cree una vista para obtener el nombre de los empleados asociados a departamentos con al menos 3 proyectos a partir del 2021. Los empleados deben aparecer ordenados seg√∫n su edad, comenzando por el menor.

In [15]:
%%sql

DROP VIEW IF EXISTS EmpleadosEnDptosActivos;

CREATE VIEW EmpleadosEnDptosActivos AS
SELECT IdE, Nombre, Apellido
FROM Empleado as e
WHERE e.IdD IN (SELECT d.IdD 
    FROM Departamento as d
        Inner Join Proyecto as p
        ON d.IdD = p.IdD
    WHERE YEAR(p.FechaInicio) >= 2021
    GROUP BY d.IdD
    HAVING COUNT(p.IdP) >= 3)
ORDER BY Edad;

 * mysql://root:***@localhost:3306
0 rows affected.
0 rows affected.

[]

f) Seleccione los nombres que empiecen con M de todos aquellos empleados asociados a departamentos con al menos 3 proyectos a partir del 2021.

In [16]:
%%sql
SELECT * FROM EmpleadosEnDptosActivos
WHERE Nombre LIKE "M%";

 * mysql://root:***@localhost:3306
0 rows affected.

[]

...¬øy con D?

In [17]:
%%sql
SELECT * FROM EmpleadosEnDptosActivos
WHERE Nombre LIKE "D%";

 * mysql://root:***@localhost:3306
1 rows affected.

[(1, 'Diana', 'Lopez')]

g) Para evitar el contrato de trabajadores de escasa capacidad, la empresa quiere limitar su cantera a personas que alcancen al menos 60 puntos en las pruebas propuestas. Proponga un _trigger_ que verifique no se puedan insertar a la base de datos empleados con una puntuaci√≥n menor a 60.

In [19]:
%%sql

CREATE TRIGGER before_employee_insertion
    BEFORE INSERT 
    ON Empleado FOR EACH ROW
BEGIN
    
    IF (Select Puntos
        FROM Candidato as c
        WHERE c.Nombre = new.Nombre
        and c.Apellido = new.Apellido
        and c.Experiencia = new.Experiencia
        and c.Edad = new.Edad) < 60 THEN
        SIGNAL SQLSTATE '45000' 
            SET MESSAGE_TEXT = 'El candidato debe alcanzar una puntuacion mayor a 60 para ser considerado por la empresa.';
    END IF;
END

 * mysql://root:***@localhost:3306
0 rows affected.

[]

h) La empresa quiere remunerar el trabajo de los empleados. Cree un _trigger_ que aumente el salario de un empleado en un 10 % cada vez que un proyecto asociado a su departamento incremente su presupuesto.

> Antes de la creaci√≥n del _trigger_:

In [50]:
%%sql
SELECT * FROM Empleado WHERE IdD = 4;

 * mysql://root:***@localhost:3306
3 rows affected.

[(7, 'Andy', 'Paul', 4400.0, 'Junior', 4, 27),
 (11, 'Andy', 'Ron', 9900.0, 'Senior', 4, 60),
 (14, 'Paulina', 'Rubio', 4400.0, 'Junior', 4, 27)]

In [48]:
%%sql

DROP TRIGGER IF EXISTS after_project_update;

CREATE TRIGGER after_project_update
    AFTER UPDATE
    ON Proyecto
    FOR EACH ROW
BEGIN
    IF NEW.Presupuesto > OLD.Presupuesto
    THEN
        UPDATE Empleado
        SET Salario = Salario * 1.1
        WHERE IdD = NEW.IdD;
    END IF;
END

 * mysql://root:***@localhost:3306
0 rows affected.
0 rows affected.

[]

> Vamos a actualizar el presupuesto del proyecto con IdP = 1:

In [51]:
%%sql
UPDATE Proyecto 
SET Presupuesto = Presupuesto + 1000000 
WHERE IdP = 1;

 * mysql://root:***@localhost:3306
1 rows affected.

[]

> Despu√©s de la creaci√≥n del _trigger_:

In [52]:
%%sql
SELECT * FROM Empleado WHERE IdD = 4;

 * mysql://root:***@localhost:3306
3 rows affected.

[(7, 'Andy', 'Paul', 4840.0, 'Junior', 4, 27),
 (11, 'Andy', 'Ron', 10890.0, 'Senior', 4, 60),
 (14, 'Paulina', 'Rubio', 4840.0, 'Junior', 4, 27)]

i) En la tabla Candidatos se registra la puntuaci√≥n que han obtenido ciertas personas en entrevistas que han realizado para aplicar a la empresa con anterioridad. Cree un procedimiento almacenado que reciba un valor $x$ y mueva hacia la lista de trabajadores de la empresa a los empleados de la cantera que hayan culminado las pruebas con un valor superior a esa marca. Aseg√∫rese de recibir el nombre del departamento al cual asociar el(los) trabajador(es), y un salario inicial.

In [18]:
%%sql
CREATE PROCEDURE MoverCandidatoPaEmpleado(
    IN minPuntos INT, 
    IN salarioInicial DOUBLE, 
    IN nombreDepartamento VARCHAR(30)
)
BEGIN
  DECLARE v_IdD INT;

  -- Get the department id based on the department name
  SELECT IdD INTO v_IdD FROM Departamento WHERE NombreDpto = nombreDepartamento;

  -- Insert the selected candidates into the Empleado table
  INSERT INTO Empleado (Nombre, Apellido, Salario, Experiencia, IdD, Edad)
  SELECT Nombre, Apellido, salarioInicial, Experiencia, v_IdD, Edad
  FROM Candidato
  WHERE Puntos > minPuntos;

  -- Delete the moved candidates from the Candidato table
  DELETE FROM Candidato WHERE Puntos > minPuntos;
END

 * mysql://root:***@localhost:3306
0 rows affected.

[]

> **Voz en _off_ con tono grave:** lo que van a leer a continuaci√≥n es s√≥lo un producto de nuestra imaginaci√≥n, cualquier semejanza con la realidad es pura coincidencia.

j) En Cinesoft hay un comedor y se hace cola para almorzar. Un ejecutivo que se encontraba de visita en la empresa se pregunta cu√°ntas posibles colas se pueden formar, si se asume que todos los empleados que se encuentran registrados van a almorzar. Por favor, ay√∫delo con su pregunta existencial.

In [31]:
%%sql
DROP PROCEDURE IF EXISTS factorial;

CREATE PROCEDURE factorial(IN x INT, OUT result BIGINT UNSIGNED)
BEGIN
  DECLARE i INT;
  SET result = 1;
  SET i = 1;

  WHILE i <= x DO
    SET result = result * i;
    SET i = i + 1;
  END WHILE;

  SELECT x AS Number, result as Factorial;
END;

 * mysql://root:***@localhost:3306
0 rows affected.
0 rows affected.

[]

In [34]:
%%sql
DROP PROCEDURE IF EXISTS cuantasColas;

CREATE PROCEDURE cuantasColas()
BEGIN
    SET @employees = (SELECT COUNT(*) FROM Empleado);
    SET @cuantasColas = 0;
    
    CALL factorial(@employees, @cuantasColas);

    SELECT @cuantasColas AS "N√∫mero de colas";
END;

 * mysql://root:***@localhost:3306
0 rows affected.
0 rows affected.

[]

k) Cree un procedimiento almacenado que devuelva una tabla de 3 columnas: Empleado, Departamento y Pertenencia. La tabla debe representar todas las posibles combinaciones de empleados y departamentos, y debe colocar en la celda correspondiente a la columna Pertenencia si el empleado pertenece o no al departamento.

> Soluci√≥n con _cross join_:

In [35]:
%%sql
CREATE PROCEDURE EmpleadoDepartamentoPertenencia()
BEGIN
  SELECT E.Nombre AS Empleado, D.NombreDpto AS Departamento,
    CASE 
      WHEN E.IdD = D.IdD THEN 'S√≠'
      ELSE 'No'
    END AS Pertenencia
  FROM Empleado E
  CROSS JOIN Departamento D
  ORDER BY Empleado, Departamento;
END

 * mysql://root:***@localhost:3306
0 rows affected.

[]

> Soluci√≥n con ciclos (esta se puede quedar de tarea):

In [36]:
%%sql
CREATE PROCEDURE EmpleadoDepartamentoPertenenciaCiclos()
BEGIN
  -- Declarar variables para almacenar los datos de las tablas
  DECLARE v_EmpleadoNombre VARCHAR(20);
  DECLARE v_DepartamentoNombreDpto VARCHAR(30);
  DECLARE v_Pertenencia VARCHAR(3);

  -- Crear una tabla temporal para almacenar los resultados
  CREATE TEMPORARY TABLE TempResultados (
    Empleado VARCHAR(20),
    Departamento VARCHAR(30),
    Pertenencia VARCHAR(3)
  );

  -- Inicializar las variables de sesi√≥n para iterar sobre las filas de las tablas
  SET @empleado_index = 1;
  SET @departamento_index = 1;

  empleados_loop: WHILE @empleado_index <= (SELECT COUNT(*) FROM Empleado) DO
    -- Obtener el empleado actual
    SELECT Nombre INTO v_EmpleadoNombre FROM Empleado WHERE IdE = @empleado_index;

    departamentos_loop: WHILE @departamento_index <= (SELECT COUNT(*) FROM Departamento) DO
      -- Obtener el departamento actual
      SELECT NombreDpto INTO v_DepartamentoNombreDpto FROM Departamento WHERE IdD = @departamento_index;

      -- Determinar si el empleado pertenece al departamento
      IF EXISTS (SELECT 1 FROM Empleado WHERE IdE = @empleado_index AND IdD = @departamento_index) THEN
        SET v_Pertenencia = 'S√≠';
      ELSE
        SET v_Pertenencia = 'No';
      END IF;

      -- Insertar el resultado en la tabla temporal
      INSERT INTO TempResultados (Empleado, Departamento, Pertenencia)
      VALUES (v_EmpleadoNombre, v_DepartamentoNombreDpto, v_Pertenencia);

      -- Incrementar el √≠ndice del departamento
      SET @departamento_index = @departamento_index + 1;

    END WHILE departamentos_loop;

    -- Incrementar el √≠ndice del empleado y reiniciar el √≠ndice del departamento
    SET @empleado_index = @empleado_index + 1;
    SET @departamento_index = 1;

  END WHILE empleados_loop;

  -- Devolver los resultados de la tabla temporal
  SELECT * FROM TempResultados;

  -- Eliminar la tabla temporal
  DROP TEMPORARY TABLE TempResultados;

END

 * mysql://root:***@localhost:3306
0 rows affected.

[]

> **Voz en _off_ con tono grave:** vamos a hacer esto m√°s interesante üòà

Las restricciones de acceso a la BD cambiaron. Ahora, ning√∫n usuario externo puede realizar consultas o modificaciones directamente, s√≥lo puede llamar a procedimientos almacenados que realicen las consultas o modificaciones en su lugar. Aun as√≠, no todos los usuarios pueden ordenar la ejecuci√≥n de ciertas operaciones.  

Contamos con una nueva tabla llamada Privilegios que almacena los privilegios que posee cada usuario:

In [40]:
%%sql
CREATE TABLE Privilegios (
  Id INT AUTO_INCREMENT PRIMARY KEY,
  UserId VARCHAR(255),
  Privilegio VARCHAR(255)
);

 * mysql://root:***@localhost:3306
(MySQLdb.OperationalError) (1050, "Table 'privilegios' already exists")
[SQL: CREATE TABLE Privilegios (
  Id INT AUTO_INCREMENT PRIMARY KEY,
  UserId VARCHAR(255),
  Privilegio VARCHAR(255)
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [41]:
%%sql
INSERT INTO Privilegios (UserId, Privilegio) VALUES ("root@localhost", "view_salary");
INSERT INTO Privilegios (UserId, Privilegio) VALUES ("root@localhost", "update_salary");
INSERT INTO Privilegios (UserId, Privilegio) VALUES ("yosvaniiiii@repahost", "view_salary");

 * mysql://root:***@localhost:3306
1 rows affected.
1 rows affected.
1 rows affected.

[]

l) Cree un procedimiento almacenado que permita cambiar el salario de un empleado. El procedimiento debe lanzar una excepci√≥n si el usuario que lo llama no posee los requisitos necesarios.

In [44]:
%%sql
DROP PROCEDURE IF EXISTS cambiarSalario;

CREATE PROCEDURE cambiarSalario(IN IdE INT, IN nuevoSalario DOUBLE UNSIGNED)
BEGIN
    -- Check if the user has the 'update_salary' privilege
    IF EXISTS (SELECT * FROM Privilegios WHERE UserId = CURRENT_USER() AND Privilegio = 'update_salary') THEN
    UPDATE Empleado AS e
    SET Salario = nuevoSalario
    WHERE e.IdE = IdE;
    ELSE
    SIGNAL SQLSTATE '45000'
    SET MESSAGE_TEXT = 'Access denied: You do not have the required privilege to update salary details.';
    END IF;
END;

 * mysql://root:***@localhost:3306
0 rows affected.
0 rows affected.

[]